app/controllers/tickets_controller.rb

  def show
    @ticket = Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @ticket = Ticket.new(params[:ticket])
    if @ticket.save!
---
INSERT INTO "tickets" ("created_at", "date", "description", "price", "stub", "time", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @ticket = Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", "2"]]

  def update
    @ticket = Ticket.find(params[:id])
    if @ticket.update_attributes(params[:ticket])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tickets" SET "title" = 'Lakers vs. Celtics 2', "price" = 0.0, "updated_at" = '2014-04-24 17:06:22.951674' WHERE "tickets"."id" = 2